*** Data Types
Javascript has 7 data types, 6 native and 1 not:
- String
- Symbol
- Number
- Boolean
- Undefined
- Null
- Object(the only non-native one)
Additionally, we can use the typeof Command to check the type of something.
#+BEGIN_SRC js :export output

  console.log(" " + typeof 4)

#+END_SRC

#+RESULTS:
:  number
: undefined
*** String
In javascript, String data type is treated in a similar fashion as everywhere else. It is an array of characters and even though it is a native datatype, it has wrapper functions. The only thing to note is that both " and ' are used to delimit a string. So if we have any of them inside of the string itself, then they must be escaped.
#+BEGIN_SRC js
let string1 = "This is ok";

// Not ok, will crash
let string2 = "This isn't ok";
#+END_SRC

ES6 introduces a new way of declaring strings which means that we do not have to worry about this. They are called Template Literals. Here are some examples:
#+BEGIN_SRC js
`Hello!`;

//This would have been a problem
`This would have "Been" a problem`;

//We can also interpolate code inside of them by using curly brackets and prepending a $ sign, Just like bash!

let hello = 1;
console.log(`This is a test ${hello + 1}`);
#+END_SRC

#+RESULTS:
: This is a test 2
: undefined
